Revit 2027 API
MEPNetworkIterator.GetAnalyticalSegment Method
 Gets the analytical segment at the current iteration step.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPAnalyticalSegment GetAnalyticalSegment()
Public Function GetAnalyticalSegment As MEPAnalyticalSegment
public:
MEPAnalyticalSegment^ GetAnalyticalSegment()
member GetAnalyticalSegment : unit -> MEPAnalyticalSegment
Return Value
MEPAnalyticalSegment
 The retrieved segment, may be null for the first step.
See Also
Reference
MEPNetworkIterator Class
Autodesk.Revit.DB.Analysis Namespace